<?php
	echo "p.149 2번문제<br>";
	echo "<b>▣ 3 과목의 총점과 평균, 등급구하기</b><br>";
	echo "------------------------------------------------------<br>";
	
	$국 = 92;
	$영 = 93;
	$수 = 95;
	$총; $평; $등;
	
	echo "국어 : $국 점<br>";
	echo "영어 : $영 점<br>";
	echo "수학 : $수 점<br>";
	echo "------------------------------------------------------<br>";
	
	$총 = $국 + $영 + $수;
	echo "총점 : $총 점<br>";
	$평 = round($총/3, 2);
	echo "점수 : $평 점<br>";
	echo "------------------------------------------------------<br>";
	
	if($평 >=90) $등="매우 우수";
	elseif($평 >=80) $등="우수";
	elseif($평 >=70) $등="보통";
	elseif($평 >=60) $등="미흡";
	else $등="매우 미흡";
	
	echo "등급 : $등<br>";
	echo "------------------------------------------------------<br>";
?>