<?php
	echo "p.149 3번문제<br>";
	echo "<b>▣봄, 여름, 가을, 겨울 switch문으로 출력하기</b><br>";
	echo "------------------------------------------------------<br>";
	
	$al = "a";
	echo "▼입력된 알파벳 ...........[ $al ]<br>";
	echo "------------------------------------------------------<br>";
	switch($al)
	{
		case "a":
		case "A":
			echo"제일 좋아하는 계절은<b>\"봄\"</b>입니다.";
			break;
		case "b":
		case "B":
			echo"제일 좋아하는 계절은<b>\"여름\"</b>입니다.";
			break;
		case "c":
		case "C":
			echo"제일 좋아하는 계절은<b>\"가을\"</b>입니다.";
			break;
		case "d":
		case "D":
			echo"제일 좋아하는 계절은<b>\"겨울\"</b>입니다.";
			break;
	}
?>